{"data":{"id":100286,"title":"Tracey.","primoId":"","slug":"","shortcode":"BpgTDSrgJKG","imageUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1546661006544-.jpg","content":"Using this dorky self portrait to say THANK YOU to everyone who sent me private messages yesterday &amp; today to check on me. I had a planned iron infusion booked for Wednesday but when I woke up yesterday my body said NUH UH so I headed into the emergency room with my iron infusion script and had it done straight away. Some have been asking about what was going on - basically because of my Von Willebrand Disease (a bleeding disorder), I lose iron heaps quicker than normal during my period. (Do I need to elaborate? Lol). I had an iron infusion last year, I was told I need one yearly but obviously with my symptoms I should have had it sooner. (I also need to look into treating my bleeding disorder better!). I saw my GP on Thursday and had a blood test to check my iron levels. Results came back the next day with my ferritin at 6 (should be 15-200). My symptoms have been - extreme tiredness, napping HARD every day for months, headaches every day, vertigo, head to toe muscle aches (feels like a struggle, concrete like heaviness), shortness of breath, heart palpitations. Yes, I have tried all kinds of iron supplements and nutrition over the last 20 years but I don’t seem to absorb enough to maintain good levels. SO ANYWAY, spent yesterday having my infusion and should start to feel better next week or so. Still feeling like a zombie but I’m so grateful to have been able to go in and get some help straight away. I need to learn to trust my instincts and take better care of myself, I bet some of you do too. 💜 Please go get yourself checked out if you’ve been feeling crappy like this - it’s no way to live #vonwillebranddisease #irondeficiency #lowferritin #takebettercareofyourself #zombiemum #NewSelfWales","imageType":"instagram_selfie","date":"2019-01-05 15:53:27","dateText":"","timestamp":1540789535,"instagramUsername":"traceytakesphotos","featuredMedia":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1546661006544-.jpg","sizes":{"medium":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1546661006544--300x300.jpg","width":300,"height":300,"__typename":"MediaSize"},"full":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1546661006544-.jpg","width":1080,"height":1080,"__typename":"MediaSize"},"__typename":"MediaSizes"},"__typename":"Media"},"__typename":"NewSelfWalesInstagramSelfie"}}