{"data":{"id":63034,"title":"vicellec","primoId":"","slug":"","shortcode":"BhJL_p0j4W-","imageUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1534615972048-.jpg","content":"For the longest time I had been debating whether or not to post something that's quite personal because I'm usually not one to blast it all over social media, however I do feel I have a duty to open up the conversation.\nSame time last year, I wasn't in the right headspace: self-loathing and isolating, un-interested, a recluse, moody, more importantly I wasn't enjoying my family - the birth of my second child, the growth and development of my first; and the love and support of my husband. For the longest time I was in denial about any possibility of depression, more specifically Postnatal. It was inconceivable. Growing up as a God-fearing person, I thought I would be impervious to it.\nLate last year after wallowing and drowning in anxiety and thoughts of self-doubt and pity for a long period of time, I left myself vulnerable and asked for help. I went to the local Early childhood and Family Centre, and spoke to the nurses who were able to provide numerous resources that I was unaware of - apart from BeyondBlue and Helpline, I had to let go of my stubbornness and get a referral from the GP to see someone.\nIf you find yourself miserable days on end (its okay to have an 'off' day every once and while), know that you are not alone, valued and you are more than enough. Also, check up on each other - I know how busy we can all be with work and family, but even a quick check-in to see how loved ones are is sometimes is all it takes for someone to open up.\nTo my friends and family: thank you for your on-going love and support - even the occasional check-ins to see how I was helped me to open up and vent.\n•\n#Blessed #Humbled #Stronger #Overcome #Conquer #Empowered #Love #Valued #SelfWorth #SelfLove #SelfPortrait #BirthdayGirl #NewSelfWales","imageType":"instagram_selfie","date":"2018-09-03 09:18:46","dateText":"","timestamp":1522834214,"instagramUsername":"vicellec","featuredMedia":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1534615972048-.jpg","sizes":{"medium":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1534615972048--300x300.jpg","width":300,"height":300,"__typename":"MediaSize"},"full":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1534615972048-.jpg","width":1080,"height":1080,"__typename":"MediaSize"},"__typename":"MediaSizes"},"__typename":"Media"},"__typename":"NewSelfWalesInstagramSelfie"}}