{"data":{"id":72297,"title":"Sania J Photography","primoId":"","slug":"","shortcode":"Bm5Et-jFIo0","imageUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1537439544811-.jpg","content":"No place in the world can give you peace, which comes from within, and in an era where “meditation” is looked at as some hippie thing, this is what happens. It's become a habit to wake up to your phone and fall asleep with your phone, our minds have created patterns of thought that lead to anxiety, fear and depression but you don’t see physical damage so you let it be. \nToday I realize how detached from reality I am. I can be anywhere and not be present in the moment, because of constant planning, worrying, thinking. Every job comes with struggles and apparently, sometimes it costs you your mental health. Some people proudly say goodbye to their mental health to be great or successful at something. Careers require you to be beyond human, and thats a fact. Me personally, I just want to be okay, actually okay, while striving for greatness. I think We actually matter, just as much as your career does. And its time we start asking ourself questions about what is important to us, what are we worried about, what gives us anxiety? and give ourselves those answers and try to manage our emotions and take conscious efforts in order to take care of ourselves. Spending 5 mins everyday just to be mindful, is so absolutely healing, Please try it 🌿 Even just reading a book 📖 What good is a great career when you are not even present inside your head? Hell any day can be our last day and it's like we weren’t even here. Lastly, I wanna let you know that you are enough, exactly as you are 💙 You. Are. Enough. \nJust. Be. In. The. Moment. And Relax.\n\nx","imageType":"instagram_selfie","date":"2018-09-21 09:05:51","dateText":"","timestamp":1535178430,"instagramUsername":"saniaj.photography","featuredMedia":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1537439544811-.jpg","sizes":{"medium":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1537439544811--300x300.jpg","width":300,"height":300,"__typename":"MediaSize"},"full":{"sourceUrl":"https:\/\/dxlab.sl.nsw.gov.au\/images-newselfwales\/selfie-1537439544811-.jpg","width":1080,"height":1080,"__typename":"MediaSize"},"__typename":"MediaSizes"},"__typename":"Media"},"__typename":"NewSelfWalesInstagramSelfie"}}